<a href="https://colab.research.google.com/github/Rajat504/CLOUDYML/blob/main/DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

 Data Frames in R Language are generic data objects of R which are used to store the tabular data. Data frames can also be interpreted as matrices where each column of a matrix can be of the different data types. DataFrame is made up of three principal components, the data, rows, and columns.

# Create Dataframe in R Programming Language

In [14]:
# using list
l1=list("A1"=LETTERS[10:17],"A2"=seq(20,160,20),"A3"=as.integer(runif(8,1,100)))
df=as.data.frame(l1)
df
is.data.frame(df)

  A1 A2  A3
1 J   20 72
2 K   40 85
3 L   60  4
4 M   80 87
5 N  100 68
6 O  120  1
7 P  140 12
8 Q  160 12

[1] TRUE

In [15]:
# Using Matrix
set.seed(101)
mat=matrix(data=as.integer(runif(40,10,100)),nrow = 10,ncol=4)
df1=as.data.frame(mat)
df1

   V1 V2 V3 V4
1  43 89 73 48
2  13 73 96 38
3  73 75 29 27
4  69 93 69 24
5  32 50 93 57
6  37 63 81 92
7  62 83 16 28
8  40 30 45 83
9  65 47 46 11
10 59 13 69 93

In [21]:
# read the csv file.
df=read.csv("/content/data.csv")

In [22]:
# read the head
head(df)

  experience job_desig  location  salary placement_count
1 2-4 yrs    Analytics  Mumbai    6to10  4479
2 5-10 yrs   Analytics  Delhi NCR 6to10  1969
3 3-8 yrs    Growth     Mumbai    15to25 3319
4 2-6 yrs    Analytics  Bengaluru 6to10   330
5 6-8 yrs    Analytics  Delhi NCR 25to50 2665
6 2-5 yrs    Consultant Bengaluru 3to6    314

In [23]:
# READ tail
tail(df)

    experience job_desig location  salary placement_count
100 3-8 yrs    Growth    Mumbai    15to25 3319
101 6-9 yrs    Data      Bengaluru 15to25 3076
102 4-8 yrs    Analytics Mumbai    3to6   3767
103 8-13 yrs   Analytics Delhi NCR 25to50 2574
104 1-6 yrs    Senior    Bengaluru 15to25 1217
105 1-3 yrs    Analytics Chennai   10to15  860

In [24]:
#shape of the dataframe
dim(df)

[1] 105   5

In [25]:
# read 2nd column
df["job_desig"]

    job_desig
1   Analytics
2   Analytics
3   Growth
4   Analytics
5   Analytics
6   Consultant
7   Analytics
8   Industry
9   Data
10  Data
11  Business
12  Analytics
13  Analytics
14  Analytics
15  Senior
16  Analytics
17  IBM
18  NON
19  Analytics
20  Consultant
21  Senior
22  Consultant
23  Analytics
24  Data
25  Analytics
26  SEO
27  Analytics
28  Data
29  Analytics
30  Senior
⋮   ⋮
76  Analytics
77  Hiring
78  Analytics
79  Analytics
80  Product
81  Principal
82  Lead
83  Analytics
84  Analytics
85  Analytics
86  Senior
87  Analytics
88  Analytics
89  Analytics
90  Analytics
91  Business
92  Analytics
93  Data
94  Analytics
95  Analytics
96  Data
97  Data
98  Business
99  Analytics
100 Growth
101 Data
102 Analytics
103 Analytics
104 Senior
105 Analytics

In [26]:
# read column experience and location for rows between 10 and 20
df[10:20,c("experience","location")]

   experience location
10 6-11 yrs   Mumbai
11 0-3 yrs    Bengaluru
12 5-10 yrs   Delhi NCR
13 3-6 yrs    Bengaluru
14 2-4 yrs    Chennai
15 2-6 yrs    Delhi NCR
16 7-12 yrs   Delhi NCR
17 2-5 yrs    Bengaluru
18 2-7 yrs    Bengaluru
19 2-7 yrs    Mumbai
20 2-4 yrs    Mumbai

In [27]:
# read between 10 to 15 rows for entire dataset except placement_count
df[10:15,-5]

   experience job_desig location  salary
10 6-11 yrs   Data      Mumbai    6to10
11 0-3 yrs    Business  Bengaluru 3to6
12 5-10 yrs   Analytics Delhi NCR 15to25
13 3-6 yrs    Analytics Bengaluru 3to6
14 2-4 yrs    Analytics Chennai   10to15
15 2-6 yrs    Senior    Delhi NCR 15to25

In [28]:
# 6. Unique, Nunique
unique(df$job_desig)

 [1] "Analytics"  "Growth"     "Consultant" "Industry"   "Data"
 [6] "Business"   "Senior"     "IBM"        "NON"        "SEO"
[11] "Program"    "Hiring"     "Head"       "Social"     "SMM"
[16] "Lead"       "Ui/ux"      "Product"    "Principal"

In [29]:
# Drop Duplicates
dim(df)
df1=unique(df)
dim(df1)

[1] 105   5

[1] 97  5

In [30]:
# dropping a column
df1=unique(df)
df1

   experience job_desig  location  salary placement_count
1  2-4 yrs    Analytics  Mumbai    6to10  4479
2  5-10 yrs   Analytics  Delhi NCR 6to10  1969
3  3-8 yrs    Growth     Mumbai    15to25 3319
4  2-6 yrs    Analytics  Bengaluru 6to10   330
5  6-8 yrs    Analytics  Delhi NCR 25to50 2665
6  2-5 yrs    Consultant Bengaluru 3to6    314
7  5-10 yrs   Analytics  Chennai   10to15 3382
8  8-13 yrs   Industry   Chennai   15to25 2922
9  5-10 yrs   Data       Bengaluru 15to25 2807
10 6-11 yrs   Data       Mumbai    6to10  1176
11 0-3 yrs    Business   Bengaluru 3to6    107
12 5-10 yrs   Analytics  Delhi NCR 15to25 1989
13 3-6 yrs    Analytics  Bengaluru 3to6    190
14 2-4 yrs    Analytics  Chennai   10to15 1783
15 2-6 yrs    Senior     Delhi NCR 15to25 1988
16 7-12 yrs   Analytics  Delhi NCR 10to15 1969
17 2-5 yrs    IBM        Bengaluru 3to6    190
18 2-7 yrs    NON        Bengaluru 6to10  2402
19 2-7 yrs    Analytics  Mumbai    15to25 4167
20 2-4 yrs    Consultant Mumbai    15to25 3383
21 1-5 yrs    Senior     Mumbai    6to10  4448
22 2-5 yrs    Consultant Bengaluru 3to6   1473
23 2-5 yrs    Analytics  Mumbai    10to15 3848
24 4-7 yrs    Data       Delhi NCR 10to15 1730
25 0-0 yrs    Analytics  Mumbai    0to3   1167
26 0-3 yrs    SEO        Ahmedabad 3to6   1248
27 12-20 yrs  Analytics  Chennai   25to50  464
28 6-10 yrs   Data       Delhi NCR 10to15 2827
29 2-5 yrs    Analytics  Bengaluru 6to10   190
30 2-5 yrs    Senior     Mumbai    3to6   4011
⋮  ⋮          ⋮          ⋮         ⋮      ⋮
68 2-5 yrs    Senior     Delhi NCR 3to6   3322
70 1-3 yrs    Data       Delhi NCR 10to15  769
71 8-13 yrs   Analytics  Delhi NCR 15to25 3319
72 3-8 yrs    Analytics  Delhi NCR 6to10  4330
73 5-10 yrs   Data       Mumbai    3to6   1831
74 2-5 yrs    Analytics  Bengaluru 3to6    190
75 3-7 yrs    Analytics  Delhi NCR 15to25  191
76 8-11 yrs   Analytics  Bengaluru 25to50 2884
77 0-2 yrs    Hiring     Mumbai    0to3    921
78 15-25 yrs  Analytics  Mumbai    25to50  322
79 2-3 yrs    Analytics  Bengaluru 3to6    190
80 1-3 yrs    Product    Delhi NCR 10to15 2388
81 12-20 yrs  Principal  Bengaluru 25to50  753
82 12-20 yrs  Lead       Bengaluru 25to50 2981
83 5-7 yrs    Analytics  Delhi NCR 6to10  2676
84 4-8 yrs    Analytics  Mumbai    3to6   3767
85 8-13 yrs   Analytics  Delhi NCR 25to50 2574
86 1-6 yrs    Senior     Bengaluru 15to25 1217
87 1-3 yrs    Analytics  Chennai   10to15  860
88 6-10 yrs   Analytics  Delhi NCR 10to15 1970
89 6-11 yrs   Analytics  Delhi NCR 15to25 2059
90 2-3 yrs    Analytics  Delhi NCR 10to15 2665
91 4-9 yrs    Business   Mumbai    6to10  2434
93 6-9 yrs    Data       Bengaluru 15to25 3076
94 3-7 yrs    Analytics  Delhi NCR 6to10  1969
95 4-8 yrs    Analytics  Kolkata   10to15  772
96 3-5 yrs    Data       Mumbai    10to15 4904
97 7-11 yrs   Data       Ahmedabad 10to15 1301
98 11-15 yrs  Business   Bengaluru 15to25  280
99 4-9 yrs    Analytics  Mumbai    10to15 1863

In [31]:
# read the dataset where experience >= 10
df[which(df$experience>10),]

    experience job_desig  location  salary placement_count
1   2-4 yrs    Analytics  Mumbai    6to10  4479
2   5-10 yrs   Analytics  Delhi NCR 6to10  1969
3   3-8 yrs    Growth     Mumbai    15to25 3319
4   2-6 yrs    Analytics  Bengaluru 6to10   330
5   6-8 yrs    Analytics  Delhi NCR 25to50 2665
6   2-5 yrs    Consultant Bengaluru 3to6    314
7   5-10 yrs   Analytics  Chennai   10to15 3382
8   8-13 yrs   Industry   Chennai   15to25 2922
9   5-10 yrs   Data       Bengaluru 15to25 2807
10  6-11 yrs   Data       Mumbai    6to10  1176
12  5-10 yrs   Analytics  Delhi NCR 15to25 1989
13  3-6 yrs    Analytics  Bengaluru 3to6    190
14  2-4 yrs    Analytics  Chennai   10to15 1783
15  2-6 yrs    Senior     Delhi NCR 15to25 1988
16  7-12 yrs   Analytics  Delhi NCR 10to15 1969
17  2-5 yrs    IBM        Bengaluru 3to6    190
18  2-7 yrs    NON        Bengaluru 6to10  2402
19  2-7 yrs    Analytics  Mumbai    15to25 4167
20  2-4 yrs    Consultant Mumbai    15to25 3383
22  2-5 yrs    Consultant Bengaluru 3to6   1473
23  2-5 yrs    Analytics  Mumbai    10to15 3848
24  4-7 yrs    Data       Delhi NCR 10to15 1730
27  12-20 yrs  Analytics  Chennai   25to50  464
28  6-10 yrs   Data       Delhi NCR 10to15 2827
29  2-5 yrs    Analytics  Bengaluru 6to10   190
30  2-5 yrs    Senior     Mumbai    3to6   4011
31  2-7 yrs    Analytics  Mumbai    10to15 3838
33  10-15 yrs  Data       Bengaluru 15to25 3241
34  7-12 yrs   Analytics  Delhi NCR 25to50 1988
35  2-5 yrs    Program    Mumbai    3to6    190
⋮   ⋮          ⋮          ⋮         ⋮      ⋮
69  2-5 yrs    Program    Mumbai    3to6    190
71  8-13 yrs   Analytics  Delhi NCR 15to25 3319
72  3-8 yrs    Analytics  Delhi NCR 6to10  4330
73  5-10 yrs   Data       Mumbai    3to6   1831
74  2-5 yrs    Analytics  Bengaluru 3to6    190
75  3-7 yrs    Analytics  Delhi NCR 15to25  191
76  8-11 yrs   Analytics  Bengaluru 25to50 2884
78  15-25 yrs  Analytics  Mumbai    25to50  322
79  2-3 yrs    Analytics  Bengaluru 3to6    190
81  12-20 yrs  Principal  Bengaluru 25to50  753
82  12-20 yrs  Lead       Bengaluru 25to50 2981
83  5-7 yrs    Analytics  Delhi NCR 6to10  2676
84  4-8 yrs    Analytics  Mumbai    3to6   3767
85  8-13 yrs   Analytics  Delhi NCR 25to50 2574
88  6-10 yrs   Analytics  Delhi NCR 10to15 1970
89  6-11 yrs   Analytics  Delhi NCR 15to25 2059
90  2-3 yrs    Analytics  Delhi NCR 10to15 2665
91  4-9 yrs    Business   Mumbai    6to10  2434
92  8-11 yrs   Analytics  Bengaluru 25to50 2884
93  6-9 yrs    Data       Bengaluru 15to25 3076
94  3-7 yrs    Analytics  Delhi NCR 6to10  1969
95  4-8 yrs    Analytics  Kolkata   10to15  772
96  3-5 yrs    Data       Mumbai    10to15 4904
97  7-11 yrs   Data       Ahmedabad 10to15 1301
98  11-15 yrs  Business   Bengaluru 15to25  280
99  4-9 yrs    Analytics  Mumbai    10to15 1863
100 3-8 yrs    Growth     Mumbai    15to25 3319
101 6-9 yrs    Data       Bengaluru 15to25 3076
102 4-8 yrs    Analytics  Mumbai    3to6   3767
103 8-13 yrs   Analytics  Delhi NCR 25to50 2574

In [32]:
# extract records where job_desig  is Analytics
df[which(df$job_desig=="Analytics"),]

    experience job_desig location  salary placement_count
1   2-4 yrs    Analytics Mumbai    6to10  4479
2   5-10 yrs   Analytics Delhi NCR 6to10  1969
4   2-6 yrs    Analytics Bengaluru 6to10   330
5   6-8 yrs    Analytics Delhi NCR 25to50 2665
7   5-10 yrs   Analytics Chennai   10to15 3382
12  5-10 yrs   Analytics Delhi NCR 15to25 1989
13  3-6 yrs    Analytics Bengaluru 3to6    190
14  2-4 yrs    Analytics Chennai   10to15 1783
16  7-12 yrs   Analytics Delhi NCR 10to15 1969
19  2-7 yrs    Analytics Mumbai    15to25 4167
23  2-5 yrs    Analytics Mumbai    10to15 3848
25  0-0 yrs    Analytics Mumbai    0to3   1167
27  12-20 yrs  Analytics Chennai   25to50  464
29  2-5 yrs    Analytics Bengaluru 6to10   190
31  2-7 yrs    Analytics Mumbai    10to15 3838
32  1-5 yrs    Analytics Bengaluru 6to10   190
34  7-12 yrs   Analytics Delhi NCR 25to50 1988
38  4-6 yrs    Analytics Delhi NCR 15to25  193
40  1-5 yrs    Analytics Delhi NCR 6to10   190
41  3-6 yrs    Analytics Chennai   10to15  898
44  4-8 yrs    Analytics Delhi NCR 6to10  1989
46  5-6 yrs    Analytics Kolkata   6to10  3636
47  8-10 yrs   Analytics Bengaluru 10to15 4541
48  10-18 yrs  Analytics Delhi NCR 25to50 2914
49  8-13 yrs   Analytics Bengaluru 25to50 1893
52  2-4 yrs    Analytics Bengaluru 10to15 1969
53  4-8 yrs    Analytics Mumbai    6to10  4840
54  3-7 yrs    Analytics Bengaluru 25to50 1993
56  3-4 yrs    Analytics Bengaluru 3to6   1173
59  5-10 yrs   Analytics Delhi NCR 10to15 1616
64  5-8 yrs    Analytics Chennai   6to10  3612
66  8-12 yrs   Analytics Delhi NCR 25to50 4470
67  10-15 yrs  Analytics Bengaluru 6to10  3612
71  8-13 yrs   Analytics Delhi NCR 15to25 3319
72  3-8 yrs    Analytics Delhi NCR 6to10  4330
74  2-5 yrs    Analytics Bengaluru 3to6    190
75  3-7 yrs    Analytics Delhi NCR 15to25  191
76  8-11 yrs   Analytics Bengaluru 25to50 2884
78  15-25 yrs  Analytics Mumbai    25to50  322
79  2-3 yrs    Analytics Bengaluru 3to6    190
83  5-7 yrs    Analytics Delhi NCR 6to10  2676
84  4-8 yrs    Analytics Mumbai    3to6   3767
85  8-13 yrs   Analytics Delhi NCR 25to50 2574
87  1-3 yrs    Analytics Chennai   10to15  860
88  6-10 yrs   Analytics Delhi NCR 10to15 1970
89  6-11 yrs   Analytics Delhi NCR 15to25 2059
90  2-3 yrs    Analytics Delhi NCR 10to15 2665
92  8-11 yrs   Analytics Bengaluru 25to50 2884
94  3-7 yrs    Analytics Delhi NCR 6to10  1969
95  4-8 yrs    Analytics Kolkata   10to15  772
99  4-9 yrs    Analytics Mumbai    10to15 1863
102 4-8 yrs    Analytics Mumbai    3to6   3767
103 8-13 yrs   Analytics Delhi NCR 25to50 2574
105 1-3 yrs    Analytics Chennai   10to15  860

In [33]:
# extract records where job_desig  is Analytics and experience >= 10 70
#filtered_df<-df[df$job_desig == "Analytics",]

#final_df<-filtered_df[filtered_df$experience > 10 & filtered_df$experience <= 70,]

#print(final_df)
filtered_fields <- subset(df, job_desig == "Analytics" & experience >= 10:70)[, c("job_desig", "experience")]
print(filtered_fields)

Warning message in experience >= 10:70:
“longer object length is not a multiple of shorter object length”

    job_desig experience
1   Analytics    2-4 yrs
2   Analytics   5-10 yrs
4   Analytics    2-6 yrs
5   Analytics    6-8 yrs
7   Analytics   5-10 yrs
12  Analytics   5-10 yrs
13  Analytics    3-6 yrs
16  Analytics   7-12 yrs
34  Analytics   7-12 yrs
47  Analytics   8-10 yrs
49  Analytics   8-13 yrs
64  Analytics    5-8 yrs
66  Analytics   8-12 yrs
71  Analytics   8-13 yrs
72  Analytics    3-8 yrs
75  Analytics    3-7 yrs
76  Analytics   8-11 yrs
83  Analytics    5-7 yrs
84  Analytics    4-8 yrs
85  Analytics   8-13 yrs
88  Analytics   6-10 yrs
89  Analytics   6-11 yrs
92  Analytics   8-11 yrs
103 Analytics   8-13 yrs

In [34]:
# extract records where job_desig  is Analytics or experience >= 10 70
filtered_fields <- subset(df, job_desig == "Analytics" & experience >= 10:70)[, c("job_desig", "experience")]
print(filtered_fields)

Warning message in experience >= 10:70:
“longer object length is not a multiple of shorter object length”

    job_desig experience
1   Analytics    2-4 yrs
2   Analytics   5-10 yrs
4   Analytics    2-6 yrs
5   Analytics    6-8 yrs
7   Analytics   5-10 yrs
12  Analytics   5-10 yrs
13  Analytics    3-6 yrs
16  Analytics   7-12 yrs
34  Analytics   7-12 yrs
47  Analytics   8-10 yrs
49  Analytics   8-13 yrs
64  Analytics    5-8 yrs
66  Analytics   8-12 yrs
71  Analytics   8-13 yrs
72  Analytics    3-8 yrs
75  Analytics    3-7 yrs
76  Analytics   8-11 yrs
83  Analytics    5-7 yrs
84  Analytics    4-8 yrs
85  Analytics   8-13 yrs
88  Analytics   6-10 yrs
89  Analytics   6-11 yrs
92  Analytics   8-11 yrs
103 Analytics   8-13 yrs